{"class_name": "Model", "config": {"name": "model_9", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "Route"}, "name": "Route", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "Direction"}, "name": "Direction", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_63", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 14, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_63", "inbound_nodes": [[["Route", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_64", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_64", "inbound_nodes": [[["Direction", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "year"}, "name": "year", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_63", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_63", "inbound_nodes": [[["embedding_63", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_64", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_64", "inbound_nodes": [[["embedding_64", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_65", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 6, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_65", "inbound_nodes": [[["year", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "day"}, "name": "day", "inbound_nodes": []}, {"class_name": "Flatten", "config": {"name": "flatten_63", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_63", "inbound_nodes": [[["batch_normalization_63", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_64", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_64", "inbound_nodes": [[["batch_normalization_64", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_65", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_65", "inbound_nodes": [[["embedding_65", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_66", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 7, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_66", "inbound_nodes": [[["day", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "month"}, "name": "month", "inbound_nodes": []}, {"class_name": "Dropout", "config": {"name": "dropout_63", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_63", "inbound_nodes": [[["flatten_63", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_64", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_64", "inbound_nodes": [[["flatten_64", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_65", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_65", "inbound_nodes": [[["batch_normalization_65", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_66", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_66", "inbound_nodes": [[["embedding_66", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_67", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 12, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_67", "inbound_nodes": [[["month", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "hour"}, "name": "hour", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_54", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_54", "inbound_nodes": [[["dropout_63", 0, 0, {}], ["dropout_64", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_65", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_65", "inbound_nodes": [[["flatten_65", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_66", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_66", "inbound_nodes": [[["batch_normalization_66", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_67", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_67", "inbound_nodes": [[["embedding_67", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_68", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 24, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_68", "inbound_nodes": [[["hour", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "daym"}, "name": "daym", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_55", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_55", "inbound_nodes": [[["concatenate_54", 0, 0, {}], ["dropout_65", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_66", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_66", "inbound_nodes": [[["flatten_66", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_67", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_67", "inbound_nodes": [[["batch_normalization_67", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_68", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_68", "inbound_nodes": [[["embedding_68", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_69", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 31, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_69", "inbound_nodes": [[["daym", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_56", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_56", "inbound_nodes": [[["concatenate_55", 0, 0, {}], ["dropout_66", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_67", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_67", "inbound_nodes": [[["flatten_67", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_68", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_68", "inbound_nodes": [[["batch_normalization_68", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_69", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_69", "inbound_nodes": [[["embedding_69", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_57", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_57", "inbound_nodes": [[["concatenate_56", 0, 0, {}], ["dropout_67", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_68", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_68", "inbound_nodes": [[["flatten_68", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_69", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_69", "inbound_nodes": [[["batch_normalization_69", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_58", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_58", "inbound_nodes": [[["concatenate_57", 0, 0, {}], ["dropout_68", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_69", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_69", "inbound_nodes": [[["flatten_69", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_59", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_59", "inbound_nodes": [[["concatenate_58", 0, 0, {}], ["dropout_69", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 1, "activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["concatenate_59", 0, 0, {}]]]}], "input_layers": [["Route", 0, 0], ["Direction", 0, 0], ["year", 0, 0], ["day", 0, 0], ["month", 0, 0], ["hour", 0, 0], ["daym", 0, 0]], "output_layers": [["dense_9", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}