{"class_name": "Model", "config": {"name": "model_11", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "year"}, "name": "year", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "Direction"}, "name": "Direction", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_77", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 6, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_77", "inbound_nodes": [[["year", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_78", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_78", "inbound_nodes": [[["Direction", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "hour"}, "name": "hour", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_77", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_77", "inbound_nodes": [[["embedding_77", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_78", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_78", "inbound_nodes": [[["embedding_78", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_79", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 24, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_79", "inbound_nodes": [[["hour", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "Route"}, "name": "Route", "inbound_nodes": []}, {"class_name": "Flatten", "config": {"name": "flatten_77", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_77", "inbound_nodes": [[["batch_normalization_77", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_78", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_78", "inbound_nodes": [[["batch_normalization_78", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_79", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_79", "inbound_nodes": [[["embedding_79", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_80", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 14, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_80", "inbound_nodes": [[["Route", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "month"}, "name": "month", "inbound_nodes": []}, {"class_name": "Dropout", "config": {"name": "dropout_77", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_77", "inbound_nodes": [[["flatten_77", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_78", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_78", "inbound_nodes": [[["flatten_78", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_79", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_79", "inbound_nodes": [[["batch_normalization_79", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_80", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_80", "inbound_nodes": [[["embedding_80", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_81", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 12, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_81", "inbound_nodes": [[["month", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "daym"}, "name": "daym", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_66", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_66", "inbound_nodes": [[["dropout_77", 0, 0, {}], ["dropout_78", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_79", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_79", "inbound_nodes": [[["flatten_79", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_80", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_80", "inbound_nodes": [[["batch_normalization_80", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_81", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_81", "inbound_nodes": [[["embedding_81", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_82", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 31, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_82", "inbound_nodes": [[["daym", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "day"}, "name": "day", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_67", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_67", "inbound_nodes": [[["concatenate_66", 0, 0, {}], ["dropout_79", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_80", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_80", "inbound_nodes": [[["flatten_80", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_81", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_81", "inbound_nodes": [[["batch_normalization_81", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_82", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_82", "inbound_nodes": [[["embedding_82", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "embedding_83", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 7, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_83", "inbound_nodes": [[["day", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_68", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_68", "inbound_nodes": [[["concatenate_67", 0, 0, {}], ["dropout_80", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_81", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_81", "inbound_nodes": [[["flatten_81", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_82", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_82", "inbound_nodes": [[["batch_normalization_82", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_83", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_83", "inbound_nodes": [[["embedding_83", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_69", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_69", "inbound_nodes": [[["concatenate_68", 0, 0, {}], ["dropout_81", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_82", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_82", "inbound_nodes": [[["flatten_82", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_83", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_83", "inbound_nodes": [[["batch_normalization_83", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_70", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_70", "inbound_nodes": [[["concatenate_69", 0, 0, {}], ["dropout_82", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_83", "trainable": true, "dtype": "float32", "rate": 0.0003, "noise_shape": null, "seed": null}, "name": "dropout_83", "inbound_nodes": [[["flatten_83", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_71", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_71", "inbound_nodes": [[["concatenate_70", 0, 0, {}], ["dropout_83", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 1, "activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["concatenate_71", 0, 0, {}]]]}], "input_layers": [["year", 0, 0], ["Direction", 0, 0], ["hour", 0, 0], ["Route", 0, 0], ["month", 0, 0], ["daym", 0, 0], ["day", 0, 0]], "output_layers": [["dense_11", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}